routes/web.php

select `products`.*, `carts`.`user_id` as `pivot_user_id`, `carts`.`product_id` as `pivot_product_id`, `carts`.`id` as `pivot_id` from `products` inner join `carts` on `products`.`id` = `carts`.`product_id` where `carts`.`user_id` = 1 order by `pivot_id` desc
---
Route::get('/cantCarrito', function(){
    //$vac = $user->products()-get();
    $user = User::find(auth()->user()->id);
    $productos = $user->products()->orderBy('pivot_id','desc')->get();